---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.ReverseIterator
source: html/89f0bc3d-1f6b-6fef-8b93-effa6b175445.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.